					//Дана строка символов, состоящая из цифр, разделенных пробелами. Вывести на экран числа этой строки в порядке возрастания их значений.

#include <iostream>
#include <stdlib.h>
#include <conio.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");

	char s_1[256];								//Основная строка
	char s_2[256];							    //Побочная строка
	int n=0;									//Размер массива чисел
	int l_2 = 0;								//Длина побочной строки
	int pos=0;									//Переменная для начальной позиции числа	
	int number = 0;								//Переменная для числа
	int n_1 = 0;								//Переменная для заношения чисел в массив  
	int r;										//Переменная для перестановки
	bool flag;									//Переменная для проверки на ввод
	
	cout << "Введите строку символов:" << endl;
	cin.getline(s_1, 256);
	
	int l_1 = strlen(s_1);								//Длина основной строки				
		
	do													//Проверка на ввод
	{
		for (int a = 0; a < l_1; a++)
		{
			if (!((s_1[a] >= '0'&& s_1[a] <= '9') || s_1[a] == ' '))		
			{
				cout << "Введено неверное значение. Введите строку заново: " << endl;
				flag = false;
				cin.getline(s_1, 256);
				int l_1 = strlen(s_1);
			}
			else
				flag = true;
		
		}
	} while (flag == false);
	
	l_1 = strlen(s_1);									//Заново вычисляется длина строки
	
	if ((l_1 - 1) != ' ')								//Добавление пробела
	{
		strcat_s(s_1, " ");								//К основной строке добавляется пробел, если последний символ не является пробелом
		l_1++;											//Увеличивается длина основной строки
	}
	if (s_1[0] == ' ')									//Проверка на то, что первый символ в строке является пробелом
	{
		for (int a = 0;  a < l_1;  a++)					//Если первый символ в строке является пробелом, то вся строка смещается на 1 пункт влево
		{
			s_1[a] = s_1[a + 1];
		}
	}
	
	for ( int a = 0;  a < l_1;  a++)					//Проверка на ввод двух пробелов
	{
		if (s_1[a] == ' ' and s_1[a + 1] == ' ')		//Если два символа строки подряд являются пробелами, то строка смещается на 1 пункт влево
		{
			for (int i = a; i < l_1; i++)
			{
				s_1[i + 1] = s_1[i + 2];
			}
		}
	}
 
	for (int a=0; a<l_1; a++)							//Поиск количества чисел посредством нахождения пробелов в массиве строк
	{
		if (s_1[a] == ' ')
			n++;
	}

	cout << endl;
	cout << "Введенная строка символов: " << endl;
	cout << s_1 << endl;
	

	int* arr = new int[n];								//Выделение памяти для одномерного динамического массива
	
	for (int a = 0; a < l_1; a++)
	{
		if (s_1[a] != ' ')								//Если символ основной строки не является пробелом, то длина числа, которое нужно перенести в побочную строку, увеличивается на 1
		{
			l_2 += 1;
			
		}
		
		if(s_1[a]==' ')									//Если символ основной строки является пробелом, то
		{
			pos = a - l_2;								//Находится позиция первого элемента числа в основной строки
			strncpy_s(s_2, s_1+pos, l_2);				//В побочную строку переносятся данные первой строки, взятые в пределах от позиции первого элемента числа до длины этого числа
			l_2 = 0;									//Зануляется значение длины числа
			number = atoi(s_2);							//С помощью функции atoi побочная строка, в которой находится одно число, преобразуется в число 
			
			arr[n_1] = number; n_1++;					//Это число заносится в массив чисел
			
		}
	}

	cout << endl;
	cout<<"Полученный массив: "<<endl;
	
	for (int i = 0; i < n; i++) {							//Вывод полученного массива чисел
		cout << arr[i]<< " ";
	}
	cout << endl;
		

	
	for (int k = 0; k < n-1; k++)							//Сортировка полученного массива по возрастанию методом пузырька
	{
		for ( int i = k+1; i < n; i++)
		{
			if(arr[k]>arr[i])
				{
					r=arr[k]; arr[k]=arr[i]; arr[i]=r;
				}
		}
	}

	cout << endl;
	cout << "Отсортированный по возрастанию массив: " << endl;
	
	for (int i = 0; i < n; i++)										//Вывод массива
	{
		cout << arr[i] << " ";
	}
	cout << endl;
	
	delete[] arr;													//Очистка памяти 
}