												//Найти сумму элементов массива, расположенных после последнего элемента, равного нулю.
#include <iostream>
#include <conio.h>
#include <stdlib.h>
#include <ctime>																										//ctime нужен для работы рандома
using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");
	char sw;
	int a_size, i, sum, i0 = -2;																						//значение -2 для i0 обозначает несуществующий индекс элемента в массиве 
	bool flag;																											//i0-переменная, значением которой является индекс последнего нуля в массиве
	

	cout << "Введите размер массива: ";																																
	while (!(cin>>a_size)||(a_size<1))																					//Проверка на ввод недопустимых значений размера массива
	{
		cout << "Введено недопустимое значение размера массива. Введите значение заново." << endl;
		cin.clear();
		cin.ignore();
	}
																														//Имя массива это указатель на его первый элемент
	int *a = new int[a_size];																							//Выделение памяти для одномерного динамического массива							
	
	cout << "Нажмите 1 если хотите задать элементы массива с клавиатуры." << endl;
	cout << "Нажмите 2 если хотите задать случайные элементы массива." << endl;
	do
	{
		sw = _getch();
		switch (sw)
		{
		case'1':																										//Ввод чисел с клавиатуры
			
			cout << "Введите элементы массива:" << endl;
			for (i = 0; i < a_size; i++)
			{
				while (!(cin>>a[i]))
				{
					cout << "Введено недопустимое значение. Введите значение заново." << endl;
					cin.clear();
					cin.ignore();
				}
			}
			flag = true;

		break;

		case'2':																										//Ввод рандомом
			
			srand(time(NULL));																							//использует системное время для того, чтобы числа при перезапуске программы отличались 		
			for (int i = 0; i < a_size; i++)
			{
				a[i] = rand() %40-20;
				cout << a[i] << " ";
			}
			cout << endl;
			flag = true;
		
		break;
		
		default:
			
			flag = false;
		
		break;
		}
	} while (flag == false);
	
	for (i = 0; i < a_size; i++)													//Поиск последнего элемента равного нулю
	{
		if (a[i] == 0)
		{
			i0 = i;
		}
	}
	if (i0==-2)																		//Случай если нуля в массиве нет
	{
		cout<<"В массиве нет нуля. Суммы нет."<<endl;
	}
	else 
	{
		if (i0 == a_size-1)															//Случай, когда последний ноль стоит последним в массиве //Номер последнего элемента = размер массива -1 так как номер первого элемента в массиве=0
		{
			cout << "Ноль стоит последним в массиве. Сумма равна нулю." << endl;
		}
		else
		{																			//Случай, когда последний ноль стоит не последним в массиве
			sum = 0;
			for (i = i0 + 1; i < a_size; i++)
			{
				sum += a[i];
			}
			cout << "Сумма=" << sum << endl;
		}
	}
		
	delete[] a;																		//Очистка памяти массива
}

