//	   | (y/z)	      1/3|		     cos(y)-z/(y-x)
//res= |x		-(y/x)   |  +  (y-x)------------------
//	   |				 |           1+(y-x)*(y-x)

#include <iostream>
#include <cmath>
using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");
	double x, y, z, result, part_1, part_2, part_3, part_4, t_1, t_2;

	cout << "Число x: ";				//Ввод числа х
	while (!(cin >> x))					//Проверка на ввод нечисловых данных
	{
		cout << "Ошибка. Введите данные заново." << endl;
		cin.clear();					//Сбрасывает ошибку
		cin.ignore();					//Игнорирует уже введенные символы
	}

	cout << "Число y: ";				//Ввод числа y
	while (!(cin >> y))					//Проверка на ввод нечисловых данных
	{
		cout << "Ошибка.Введите данные заново." << endl;
		cin.clear();					//Сбрасывает ошибку
		cin.ignore();					//Игнорирует уже введенные символы
	}

	cout << "Число z: ";				//Ввод числа z
	while (!(cin >> z))					//Проверка на ввод нечисловых данных
	{
		cout << "Ошибка. Введите данные заново." << endl;
		cin.clear();					//Сбрасывает ошибку
		cin.ignore();					//Игнорирует уже введенные символы
	}

	t_1 = y / x;						//Промежуточное действие
	t_2 = y - x;						//Промежуточное действие

	if (x == 0. || t_2 == 0.)
	{
		cout << "Невозможно произвести деление на 0." << endl << "Невозможно решить пример." << endl;
	}
	else
	{
		part_1 = abs((pow(x, t_1)) - (cbrt(t_1)));		//Промежуточное действие основного выражения
		part_2 = cos(y) - (z / (t_2));					//Промежуточное действие основного выражения
		part_3 = 1 + pow(t_2, 2);						//Промежуточное действие основного выражения
		part_4 = t_2 * (part_2 / part_3);				//Промежуточное действие основного выражения


		result = part_1 + part_4;						//Результат
		result = round(result * 10000) / 10000;			//Округление результата
		cout << "Результат: " << result << endl;		//Вывод результата


		cout << "яй ца" << endl;


	}
}